ExchangePlans/ExchangeSmallBusinessSite.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<ExchangePlan>
		<Properties>
			<Name>ExchangeSmallBusinessSite</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ProductsExchange</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OrdersExchange</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExportToSite</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExportDirectory</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SiteAddress</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UserName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Password</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UseScheduledJobs</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ScheduledJobID</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CounterpartiesIdentificationMethod</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CounterpartiesIdentificationMethods</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CounterpartyToSubstituteIntoOrders</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Counterparties</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CompanyToSubstituteIntoOrders</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GroupForNewProductsAndServices</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ProductsAndServices</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GroupForNewCounterparties</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Counterparties</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExportPictures</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SavedDirectoriesTable</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ImportFile</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PerformFullExportingCompulsorily</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RegisterChanges</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExportBalanceForWarehouses</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>OrdersStatesCorrespondence</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>OrderStatusOnSite</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>CustomerOrderStatus</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CustomerOrderStates</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>PriceKinds</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>PriceKind</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.PriceKinds</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ExchangePlan>
</MetaDataObject>

Enums/CounterpartiesIdentificationMethods.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>CounterpartiesIdentificationMethods</Name>
			<Comment>Methods of the counterparties identification for the orders exchnage with the website</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Description</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TINKPP</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PredefinedValue</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ExchangePlans/ExchangeSmallBusinessSite/Ext/ObjectModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region EventsHandlers

Procedure BeforeDelete(Cancel)
	
	Task = ExchangeWithSiteScheduledJobs.FindJob(ScheduledJobID);
	If Task <> Undefined Then
		ExchangeWithSiteScheduledJobs.DeleteJob(Task);
	EndIf;
	ScheduledJobID = Undefined;
	
EndProcedure

Procedure FillCheckProcessing(Cancel, CheckedAttributes)
	
	If IsBlankString(Code) Then
		SetNewCode();
	EndIf;
	
	If IsBlankString(Description) Then
		GenerateDescription()
	EndIf;
	
	If Not ProductsExchange
		AND Not OrdersExchange Then
		
		Cancel = True;
		Message = NStr("en = 'Exchange mode is not selected!'");
		Field = "ProductsExchange";
		CommonUseClientServer.MessageToUser(Message, ThisObject, Field);
		
	EndIf;

	AddCheckedAttributes(CheckedAttributes);
	
EndProcedure

Procedure OnCopy(CopiedObject)
	Code = "";
	ScheduledJobID = UNDEFINED;
EndProcedure

#EndRegion

#Region ProgramInterface

// Generates object unique description
// 
// Parameters:
// no
// 
// Returns:
// no
//
Procedure GenerateDescription() Export
	
	If ProductsExchange AND OrdersExchange Then
		
		Prefix = NStr("en = 'Products and orders exchange'");
		
	ElsIf OrdersExchange Then
		
		Prefix = NStr("en = 'Orders exchange'");
		
	Else
		
		Prefix = NStr("en = 'Products export'");
		
	EndIf;
	
	Query = New Query();
	Query.Text = 
	"SELECT
	|	MAX(ExchangeSmallBusinessSite.Description) AS Description
	|FROM
	|	ExchangePlan.ExchangeSmallBusinessSite AS ExchangeSmallBusinessSite
	|WHERE
	|	ExchangeSmallBusinessSite.Description LIKE &Pattern
	|
	|HAVING
	|	(NOT MAX(ExchangeSmallBusinessSite.Description) IS NULL )";
	
	Query.SetParameter("Pattern", Prefix + "%");
	QueryResult = Query.Execute();
	
	If QueryResult.IsEmpty() Then
		Description = Prefix;
		Return;
	EndIf;
	
	Selection = QueryResult.Select();
	Selection.Next();
	Suffix = Right(TrimAll(Selection.Description), 4);
	
	Try
		SuffixByNumber = Number(Suffix);
	Except
		Description = Prefix + " 0001";
		Return;
	EndTry;
	
	Description = Prefix + " " + Format(SuffixByNumber + 1, "ND=4; NLZ=; NG=");
	
EndProcedure

#EndRegion

#Region ServiceProceduresAndFunctions

Procedure AddCheckedAttributes(CheckedAttributes)
	
	If ExportToSite Then
		
		CheckedAttributes.Add("SiteAddress");
		CheckedAttributes.Add("UserName");
		
	Else
		
		CheckedAttributes.Add("ExportDirectory");
		
	EndIf;

	If OrdersExchange Then
		
		If Not ExportToSite Then
			CheckedAttributes.Add("ImportFile");
		EndIf;
		
		CheckedAttributes.Add("CounterpartiesIdentificationMethod");
		
		If CounterpartiesIdentificationMethod = Enums.CounterpartiesIdentificationMethods.PredefinedValue Then
			CheckedAttributes.Add("CounterpartyToSubstituteIntoOrders");
		EndIf;
		
	EndIf;
	
EndProcedure

#EndRegion

#EndIf
